TOKEN_API = "6598630985:AAH6hm8idDR8J4SxkhljfEzBoYnKE4Q4X4s"

# Характеристика персонажей
wizard = dict(name='Волшебник', pw=60, hp=55)
knight = dict(name='Рыцарь', pw=40, hp=70)

# Характеристики монстров(pw - сила, hp - здоровье)
slime = dict(name='Слайм', pw=20, hp=40)
spider = dict(name='Паук', pw=30, hp=40)
skeleton = dict(name='Скелет', pw=45, hp=60)
golem = dict(name='Голем', pw=55, hp=65)
demon = dict(name='Демон', pw=75, hp=85)  # Босс для Волшебника
dragon = dict(name='Дракон', pw=55, hp=90)  # Босс для Рыцаря

# Здоровье
HP_KNIGHT = 70
HP_WIZARD = 55

HP_SLIME = 30
HP_SPIDER = 40
HP_SKELETON = 60
HP_GOLEM = 65

HP_DEMON = 85
HP_DRAGON = 90

# Текст при запуске бота
START_TEXT = ''' 
Здравствуй, друг! Приветствую тебя в моём боте. Это приключение затянет тебя надолго.
'''

# Текст кнопки информация (написать)
INFORMATION_TEXT = ''' 
ТУТ БУДЕТ ТЕКСТ ПРО БОТА И ОПИСАНИЕ ИГРЫ
'''

START_GAME_TEXT = f'''
Перед начало ознакомьтесь с характеристиками персонажей, которых вам надо будет выбрать для прохождения игры:

ХАРАКТЕРИСТИКА ВОЛШЕБНИКА:\n
Здоровье: {wizard["hp"]}
Сила: {wizard["pw"]}

ХАРАКТЕРИСТИКА РЫЦАРЯ:\n
Здоровье: {knight["hp"]}
Сила: {knight["pw"]}
'''

WIZARD_OPS = f'''
Характеристики волшебника:\n
Здоровье: {wizard["hp"]}
Сила: {wizard["pw"]}
'''

KNIGHT_OPS = f'''
Характеристики рыцаря:\n
Здоровье: {knight["hp"]}
Сила: {knight["pw"]}
'''

WIZARD_HISTORY = '''
Волшебник, хороший выбор!
'''

KNIGHT_HISTORY = '''
Рыцарь, хороший выбор!
'''

WIZARD_START_TEXT = '''
Вы появляйтесь в подземелье и видите перед собой две двери, в какую войдете?
'''

KNIGHT_START_TEXT = '''
Вы появляйтесь в подземелье и видите перед собой две двери, в какую войдете?
'''

# Текста при встречах с монстрами
SLIME_MEETING = f'''
Вы встречайте перед собой слайма. Перед тем как выбрать действие посмотрите характеристики монстра:\n
Характеристики слайма:
Здоровье: {slime["hp"]}
Сила: {slime["pw"]}
'''

SPIDER_MEETING = f'''
Вы встречайте перед собой паука. Перед тем как выбрать действие посмотрите характеристики монстра:\n
Характеристики паука:
Здоровье: {spider["hp"]}
Сила: {spider["pw"]}
'''

SKELETON_MEETING = f'''
Вы встречайте перед собой скелета. Перед тем как выбрать действие посмотрите характеристики монстра:\n
Характеристики скелета:
Здоровье: {skeleton["hp"]}
Сила: {skeleton["pw"]}
'''

GOLEM_MEETING = f'''
Вы встречайте перед собой голем. Перед тем как выбрать действие посмотрите характеристики монстра:\n
Характеристики голема:
Здоровье: {golem["hp"]}
Сила: {golem["pw"]}
'''

YOU_DEAD_SPIDER_WIZARD = '''
Вы умерли от лап паука!
Игра окончена!
'''

YOU_DEAD_SLIME_WIZARD = '''
Вы умерли от слайма!
Игра окончена!
'''

YOU_DEAD_SKELETON_WIZARD = '''
Вы умерли от скелета!
Игра окончена!
'''

YOU_WIN_SPIDER_WIZARD = '''
Вы победили паука!
'''

AFTER_WIN_SPIDER_WIZARD = '''
???
'''

# вывод здоровья после поя
AFTER_FIGHT_WIZARD_HP = '''
После боя у вас осталось здоровья: 
'''

# побег 1_1
AWAY_TEXT_WIZARD_SPIDER_1_1 = '''
Вы решайте сбежать от паука.\n 
При попытке побега паук вас задевает
и вы теряйте 5 здоровья.
'''

AWAY_TEXT_WIZARD_SLIME_1_2 = '''
Вы решайте сбежать от слайма.\n 
При попытке побега слайм вас задевает
и вы теряйте 3 здоровья.
'''

# после 1_1 переход во вторую комнату
TWO_ROOM_WIZARD_SPIDER = '''
После победы над пауком вы проходите в следующую комнату и видите две двери, в какую войдете?
'''
# после 2_1 переход во третью комнату
THREE_ROOM_WIZARD_SKELETON = '''
После победы над скелетом вы проходите в следующую комнату и видите две двери, в какую войдете?
'''

# после 1_2 переход во вторую комнату
TWO_ROOM_WIZARD_SLIME = '''
После победы над слаймом вы проходите в следующую комнату и видите две двери, в какую войдете?
'''

# после 2_1 переход в третью комнату
THREE_ROOM_WIZARD_SLIME = '''
После победы над слаймом вы проходите в следующую комнату и видите две двери, в какую войдете?
'''

# после 3_1 переход в третью комнату
FOUR_ROOM_WIZARD_GOLEM = '''
После победы над големом вы проходите в следующую комнату и видите две двери, в какую войдете?
'''

# после 3_2 переход в третью комнату
FOUR_ROOM_WIZARD_SPIDER = '''
После победы над пауком вы проходите в следующую комнату и видите две двери, в какую войдете?
'''

AWAY_TEXT_WIZARD_SKELETON_2_1 = '''
Вы решайте сбежать от скелета.\n 
При попытке побега слайм вас задевает
и вы теряйте 7 здоровья.
'''

NO_HP_DEAD_WIZARD = '''
Вы погибли от нехватки здоровья!
Игра окончена!
'''

AFTER_AWAY = '''
После побега у вас осталось здоровья: 
'''

YOU_WIN_SLIME_WIZARD = '''
Вы победили слайма!
'''

YOU_DEAD_GOLEM_WIZARD = '''
Вы умерли от голема!
Игра окончена!
'''

YOU_WIN_GOLEM_WIZARD = '''
Вы победили голема!
'''

YOU_WIN_SKELETON_WIZARD = '''
Вы победили скелета!
'''

TRANSITION_TO_1_1_WIZARD = f'''
Войдя в другую дверь, вы видите перед собой паука с характеристиками:\n
Характеристики паука:
Здоровье: {spider["hp"]}
Сила: {spider["pw"]}\n
Вариантов у вас не будет, вы точно будете сражаться с пауком, т.к сбежали из другой комнаты.
'''

TRANSITION_TO_1_2_WIZARD = f'''
Войдя в другую дверь, вы видите перед собой слайма с характеристиками:\n
Характеристики паука:
Здоровье: {slime["hp"]}
Сила: {slime["pw"]}\n
Вариантов у вас не будет, вы точно будете сражаться с пауком, т.к сбежали из другой комнаты.
'''

TRANSITION_TO_2_1_WIZARD = f'''
Войдя в другую дверь, вы видите перед собой слайма с характеристиками:\n
Характеристики паука:
Здоровье: {slime["hp"]}
Сила: {slime["pw"]}\n
Вариантов у вас не будет, вы точно будете сражаться с пауком, т.к сбежали из другой комнаты.
'''

TRANSITION_TO_2_2_WIZARD = f'''
Войдя в другую дверь, вы видите перед собой скелета с характеристиками:\n
Характеристики паука:
Здоровье: {skeleton["hp"]}
Сила: {skeleton["pw"]}\n
Вариантов у вас не будет, вы точно будете сражаться с скелетом, т.к сбежали из другой комнаты.
'''